"builtin.module"() ({
  "ml_program.global"() {sym_name = "dense/bias", sym_visibility = "private", type = tensor<32xf32>, value = dense<0.000000e+00> : tensor<32xf32>} : () -> ()
  "ml_program.global"() {sym_name = "dense/kernel", sym_visibility = "private", type = tensor<16x32xf32>, value = dense<"0x00FBB43DF51C873E52CA133E64249ABE8E7D5A3EA07092BE306293BE74F4E0BD907AE63CED89903E98C7B83D0001FC3BBE1B6D3E2888613DF48286BD66EF233E3C9895BD8D7895BED0D3AABDB5F2933EBB33A6BE4452FD3D23695FBE400B4F3C57BDA03E9E280A3E104EFD3D28A3A2BD460E183E7F8254BEE816F2BDD51A9FBE92C01DBE4ACC7F3E1A7C703EA85A1F3D18727DBD42FF313E00A976BCB603213EEA1D3E3EE8C8553D1097C8BD0CBEB6BD6CDEE43D28B3493DEC75F73DA26F7C3E4010363D0099D03A4079F5BBD5D1943E60608E3C6AE290BEDCC2EF3D0D8018BE50FED2BC00F9AD3B865D16BEF078C9BD6C544CBE8ACE733E82FAD8BD47128C3E26F3253E6AC333BEB721863E72B72D3E63C3AB3E229F4F3E429E453EA875C0BD9A0F0B3E377E9ABEA12E86BE5EAD793EDEF19DBE480C123D0B8E17BEAD40AF3E6DF2B3BEA286693E38D8BEBD32C464BE351BA3BE5B5BAD3EF68B9EBE70023ABD0194813E9E00533EF0FB643D5414CF3DC05D33BC8DB7973E80627D3CECA280BEF480A0BDE8386FBE15C0AA3E6448A8BEFA5D3B3E7527A53E34A59E3D802FCD3B68CF983DF7FDA23E8ADC37BE70838ABC00DFA63CB81A02BE00807DBA1CD09CBE001539BD1E8A1F3E195AB1BEA6031A3EFE96703E00FF383B921786BE002E103D96A5153EE4128FBD09C727BED028C93CFCC975BE002016BA049ED3BD80ED5BBEFB09B23E86F5623E317EA13EC87E90BD008E663BCB7F66BEE45BD0BDA2AA5F3E5732803EA86770BDBE65413E520A3C3EBF869C3E188F32BDCB67933E20D2D03C7C6C923DDA573F3EB07787BCD02DC03CA6B9453E34FAE8BD0037E93C10940EBD7894C3BDC00F01BD28252DBDB8C5C23D0EF26E3EE55D9BBED023B33DAD1E943E6E45573E80886E3D40D8813D6045A53C8FFC9EBEC087CEBBCAAC1D3E93F937BEC2AD413E127D383E0A6F1B3E72605B3E5CC2E43DC054593DA896B8BD602288BEB60D6B3E195E9C3EC06FE8BCA2FB603E9CD3BBBDB721B43E3C00B0BEC348883E028B6E3E3BDDA3BE4A25723E269D283E58EF153DC2A33F3E5CE412BE06AF3FBE30C3E13D5089AABEC0BD3BBC2F54A13E86752E3EEAC50C3E2BDC1DBEEA244CBEDAAFAEBE5A09663EA0C2313C804B94BD9264B4BE23A3B0BE4C1B8ABDD087FA3CE0F917BE3CDF84BD02346DBE2070FA3C42C026BE488ABFBDC00777BD070A9B3E021D2D3E5914B03E52CEA6BE9EF9493E5D99A2BE34D8C2BDB05899BE00BF853DC0B88CBDC07EE63BB838303DD84A263DB76C923E5AA0763EFC9D93BE05C754BE468215BE5C778FBEF655AABE2E45A3BE6A982FBEEAD73D3E78A6003DE115903E94DB46BEB6C56ABE205C49BCCBBF9A3E9837763DB1C0A53E0CC7B03DC5F130BEF290323E8BF7AABE9C9D99BDF01B93BD2B09AB3EA6E9503EA022043C7201723E7357843E6A35383E0B2AAEBE52BF443E348D063E7E9B1D3EB325B33EC0C53EBD8A1B5A3ED188883ED0AEDEBD8C7E84BD2BD68B3E9EEB96BE0227E6BD158EAB3E588AE53DA55C8D3E09DD0BBE9B7C9E3EE6CE73BE91E49D3E2C0292BEB0E0F43DD4CF6FBEC00B933D7C411EBE96B367BE528C783E80AC9A3B60FFC4BCBE08423E4ACC67BE6AE17D3EC2C01BBE82301BBE8C2209BE365C453EB267A1BEAA65563E02A271BEBFC3AC3EFA59643EBAA9313E4AC691BEA14F54BE2527AF3E052516BE0824CD3D5E4C073EFCABBCBD32D1F0BD4DB444BEC8E1903DF4558ABE642A9ABEB87C553D7A791A3E9C5934BE14EBB0BD7BF7A43E9C4697BDA939ABBE3600403EF02195BD1064A63D895D18BE7EE37C3ED912ADBED89906BE5A2C1C3EBDE6A63ED436C6BD68F284BE306E33BDDA627B3E63548B3E8CF3ACBE1F30B03E8BA896BEC0A511BC76C2563EB39A9C3EAFA49B3E9EF07F3EC2281D3E983251BD91C6AA3EB06A73BE88D0D33DA46F093E5C2F86BE2555AC3ED839033DBE5E333E1A1B5A3E09CB813E4F5A8B3E480618BD406D37BCE863EB3D25C7A93E1AB07E3E2FE4A63E0005063E1DB852BE2C4F8BBEF9894ABEEA74353E1815193D28A60B3D07D1B3BE009787BE11DCAE3E01229D3E0054CBBA2322B33EC070343C124C3BBE04AF8EBE88B0B63DEA33413E55998DBE0363833E91D7983EFB6B19BED0ACDF3C048A5BBE0FE50FBE80F565BC59109C3E80489FBD2029F83DB87A08BED1CFA73EA0BF58BD87C82DBE549B97BDAF46A9BE1FA9AA3E50D2E5BCB0B8A3BD40C6B73D02387A3E00F08B3C4F21B3BE58AA0C3E2A9F6C3E5CCB24BEBDB0B13E3CAFFCBD401B1B3CD9D1A43E1D7EAE3EF800A3BED3DA943E908C41BE3DED30BE5745843E0A88593E0A485E3E9816033D2C44EE3D0BBD8A3EF093AFBC7E3A063EC4FDE7BD19862ABED88D17BEA8B10C3ECBED9F3E48ABB43DE88CC83D10F2BE3DE67D773E2CE2A2BD3B695EBECF42A03E864D763E6B1D96BE937A0FBEDAEBB3BEFC6BC63D503AF6BCE66E703ED03F7CBDE3B28BBEBBAA9C3E806F9CBC7D1561BED37CB1BE32E06C3E62544FBE126DA2BE5C2C9FBDF8AB06BDB0C8CDBC1A87793E594AA13EE02C6B3C7CDED0BD7D1621BEFE3D40BEF087953C3FEF9E3E6625503E6B40B23EB0C7AE3D84D143BE76C6AFBE6E9C723E48421BBD81E5A63E805F7FBC4A543C3E1E75A6BE5A2CF3BDFA4DE8BDF26423BE00A02E3D3B86993E5027C9BD1E422C3E486B063EE1CA49BE5C1FFB3DA02CE0BC3C2983BD2A6E72BEC06361BDC824583DC8FE02BEF246D8BD6B7F983E70208FBE57928B3E69D9983EF4DE83BD38992ABD30DF77BE09C239BE0861663D00ECFCBCA000C03DC006423CC229E4BDB2D1A7BE9221423EEE943A3E790DB2BE6E8B683E2AE164BE00FE353AE0D9D23DC8CC18BD944689BE"> : tensor<16x32xf32>} : () -> ()
  "ml_program.global"() {sym_name = "dense_1/bias", sym_visibility = "private", type = tensor<10xf32>, value = dense<0.000000e+00> : tensor<10xf32>} : () -> ()
  "ml_program.global"() {sym_name = "dense_1/kernel", sym_visibility = "private", type = tensor<32x10xf32>, value = dense<"0xEB92823E2B25923EC84965BDA32496BE735C60BEE89882BEC46D60BE3818AFBD3E1E533EAEED113E6DBF34BE92E67E3ECDA1933E23D9AC3E43818D3E40E20BBD35C631BED44A75BEC615303ED37716BED3DCB33E187BE6BD271E0FBE19F247BE48084FBE3350883EB317953ED0249ABDE85EB93DEA9F2F3E5A88073ED927A93EE5669D3E11CDB4BE260C143E68664A3DA55E2ABEE67A74BEA883D93D40D6A13D4D6C69BE96844E3E7ACD473E1C7C8FBE568526BE587BBD3D906BE3BD78939A3D2631453E6FD7943E58E706BE510399BE13E047BE6FA4823EF8514F3DB457D0BDBB32953EB8A2B63D0636B9BE18B5023DB89DB83DCCD686BE70CAD93DDF53973E506130BE73DE833ED753B63E67A7BEBEEB0260BE88E0DEBDB31275BED8EBB33D8EFD183E5312933E6DD723BE967D493EB47098BE78802DBE1829E93D4014F0BC78B1EA3D15C8BE3E5010E33C1F0752BEE9908BBEEF39BA3E7093C0BC2036C6BCA08B7ABD847A98BED0BF043DE829ABBE7A887C3EA009B7BD190A29BE68308DBD76138ABE14A594BDC0A6F23D80803DBBF0C0AEBEA683A5BEC6AC8FBE40A1BCBE60FFFABDB66D753EE481DABDA22F3FBE9DC8AABE7093EF3D6F7062BE9CB2A4BE64FD64BE64ACFBBD4E472D3E88D571BD3B42853EE113993E58B87DBD00D352BC918945BE70F285BC70C0963CB299363EC2B23F3EA38FB83E0F7DBEBEF0DDA9BC8B3E4CBE90F254BD6AA29EBE1F088BBEC8F8F33DD248093E601F463CCCD9EBBD340FA3BD55FE8D3EEE4888BE3B9A91BEA0699ABCBA4A433E557EB83EA6A64B3E09CEB8BE1023CCBCCA943EBE02A63FBE981DCA3D2E6A7E3E847E7ABEC801013D3321833EB44AC4BDBBEB893E6B62933E71D530BE62BB90BE60BABEBCBA710C3EA81DA7BDC2E3A9BEE820703D44A3913D355386BE70A2FF3CC0D1B0BC46F1393E27EC8ABE6151A5BE1E35613E20C74ABC73A28CBE103E15BD6078C0BCDEF91EBE6E3D5C3E9D8DAA3E6BFBB33ED0D3C8BDA474B73D185BC23D7DFF853E6830743DB8766F3D403C9C3B88FAAF3D308A3BBDB94833BE808D1E3D4520C0BE2E1E65BE00003CBDDEEA433EDCDDC3BDB6F6623E7ABB8BBE90FEA5BCD0A9743DCEC57A3E429B93BEF28CAABE39C48E3E40A5953D66CC023E6783C13E92CB2A3E4E0B4BBE5640633EB98425BE8745843E5BEFB63EDAC4293E3E01043EDB438C3E87A19C3EE0F3F13C9B1CA0BE22B10CBECC7598BDAE894E3E3AE4A0BE96DE203E5E08393EF857693D4C93B8BECD71BABE907870BEB99C9D3E7F3FA6BE1EDE693E4C7CA9BD505F8ABE5ADB3F3E41DE44BE8A58103E745BB6BE3089DBBD180C0D3D26DC723E9BC082BE9012C8BC70E870BED63F2A3EC88A053DD6CDBDBEC00D9DBC3D2828BE89E199BE6A4224BE9D158F3E03DFBB3EFBE874BEBAE73EBE20A7DEBC9748A03E3292793EEE36013EC8641ABDC949B9BEC57233BED96811BE9DAAAE3EC1A190BE1413AFBD1F2E9DBED015E13C2087583CBABC3C3E06BF37BEA05AADBECA40593EB515803ED767913EA2334B3E7E715F3EE8EEA93DABBC8B3EE3199A3E50DAB83C16ED01BED7C08B3E00CA5FBC6B73ACBE40FA4D3C10D22BBEB4149BBEE06FADBC260D343E28D7B4BE8E9904BEEA604C3E200C0DBC2145AEBE67278F3E05C19E3E0E012D3E00ECB53B36DA7D3E505785BCB243673E48DDC7BDD05F95BC6AEA473EAF24B2BEF3CD8C3EB3DEBB3E94A6D73D5284043E1B8575BE105753BD48ADD13D24B9A4BE42E6033E6D66C0BED4CE18BEF8042A3D23F9B0BE527B083E7C361ABE"> : tensor<32x10xf32>} : () -> ()
  "func.func"() ({
  ^bb0(%arg0: !iree_input.buffer_view):
    %0 = "iree_input.cast.buffer_view_to_tensor"(%arg0) : (!iree_input.buffer_view) -> tensor<?x2x16xf32>
    %1 = "func.call"(%0) {callee = @serving_default__ireesm} : (tensor<?x2x16xf32>) -> tensor<?x?x10xf32>
    %2 = "iree_input.cast.tensor_to_buffer_view"(%1) : (tensor<?x?x10xf32>) -> !iree_input.buffer_view
    "func.return"(%2) : (!iree_input.buffer_view) -> ()
  }) {function_type = (!iree_input.buffer_view) -> !iree_input.buffer_view, iree.abi = "{\22a\22:[[\22named\22,\22dense_input\22,[\22ndarray\22,\22f32\22,3,null,2,16]]],\22r\22:[[\22sdict\22,[\22dense_1\22,[\22ndarray\22,\22f32\22,3,null,null,10]]]],\22v\22:1}", sym_name = "serving_default"} : () -> ()
  "func.func"() ({
  ^bb0(%arg0: tensor<?x2x16xf32>):
    %0 = "mhlo.constant"() {value = dense<0.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %1 = "mhlo.constant"() {value = dense<1> : tensor<i32>} : () -> tensor<i32>
    %2 = "mhlo.constant"() {value = dense<10> : tensor<1xi32>} : () -> tensor<1xi32>
    %3 = "mhlo.constant"() {value = dense<[0, 1]> : tensor<2xi32>} : () -> tensor<2xi32>
    %4 = "mhlo.constant"() {value = dense<2> : tensor<1xi32>} : () -> tensor<1xi32>
    %5 = "mhlo.constant"() {value = dense<32> : tensor<1xi32>} : () -> tensor<1xi32>
    %6 = "shape.shape_of"(%arg0) : (tensor<?x2x16xf32>) -> tensor<3xindex>
    %7 = "arith.index_cast"(%6) : (tensor<3xindex>) -> tensor<3xi32>
    %8 = "mhlo.torch_index_select"(%7, %4) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<3xi32>, tensor<1xi32>) -> tensor<1xi32>
    %9 = "mhlo.reduce"(%8, %1) ({
    ^bb0(%arg1: tensor<i32>, %arg2: tensor<i32>):
      %45 = "mhlo.multiply"(%arg1, %arg2) : (tensor<i32>, tensor<i32>) -> tensor<i32>
      "mhlo.return"(%45) : (tensor<i32>) -> ()
    }) {dimensions = dense<0> : tensor<1xi64>} : (tensor<1xi32>, tensor<i32>) -> tensor<i32>
    %10 = "mhlo.torch_index_select"(%7, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<3xi32>, tensor<2xi32>) -> tensor<2xi32>
    %11 = "mhlo.reduce"(%10, %1) ({
    ^bb0(%arg1: tensor<i32>, %arg2: tensor<i32>):
      %45 = "mhlo.multiply"(%arg1, %arg2) : (tensor<i32>, tensor<i32>) -> tensor<i32>
      "mhlo.return"(%45) : (tensor<i32>) -> ()
    }) {dimensions = dense<0> : tensor<1xi64>} : (tensor<2xi32>, tensor<i32>) -> tensor<i32>
    %12 = "tensor.expand_shape"(%11) {reassociation = []} : (tensor<i32>) -> tensor<1xi32>
    %13 = "tensor.expand_shape"(%9) {reassociation = []} : (tensor<i32>) -> tensor<1xi32>
    %14 = "mhlo.concatenate"(%12, %13) {dimension = 0 : i64} : (tensor<1xi32>, tensor<1xi32>) -> tensor<2xi32>
    %15 = "mhlo.concatenate"(%10, %5) {dimension = 0 : i64} : (tensor<2xi32>, tensor<1xi32>) -> tensor<3xi32>
    %16 = "chlo.dynamic_reshape"(%arg0, %14) : (tensor<?x2x16xf32>, tensor<2xi32>) -> tensor<?x?xf32>
    %17 = "ml_program.global_load"() {global = @"dense_1/bias"} : () -> tensor<10xf32>
    %18 = "ml_program.global_load"() {global = @"dense_1/kernel"} : () -> tensor<32x10xf32>
    %19 = "ml_program.global_load"() {global = @"dense/bias"} : () -> tensor<32xf32>
    %20 = "ml_program.global_load"() {global = @"dense/kernel"} : () -> tensor<16x32xf32>
    %21 = "mhlo.dot"(%16, %20) : (tensor<?x?xf32>, tensor<16x32xf32>) -> tensor<?x32xf32>
    %22 = "chlo.dynamic_reshape"(%21, %15) : (tensor<?x32xf32>, tensor<3xi32>) -> tensor<?x?x?xf32>
    %23 = "shape.shape_of"(%22) : (tensor<?x?x?xf32>) -> tensor<3xindex>
    %24 = "mhlo.dynamic_broadcast_in_dim"(%19, %23) {broadcast_dimensions = dense<2> : tensor<1xi64>} : (tensor<32xf32>, tensor<3xindex>) -> tensor<?x?x?xf32>
    %25 = "mhlo.add"(%22, %24) : (tensor<?x?x?xf32>, tensor<?x?x?xf32>) -> tensor<?x?x?xf32>
    %26 = "tensor.cast"(%25) : (tensor<?x?x?xf32>) -> tensor<?x?x32xf32>
    %27 = "chlo.broadcast_maximum"(%26, %0) {broadcast_dimensions = dense<> : tensor<0xi64>} : (tensor<?x?x32xf32>, tensor<f32>) -> tensor<?x?x32xf32>
    %28 = "shape.shape_of"(%27) : (tensor<?x?x32xf32>) -> tensor<3xindex>
    %29 = "arith.index_cast"(%28) : (tensor<3xindex>) -> tensor<3xi32>
    %30 = "mhlo.torch_index_select"(%29, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<3xi32>, tensor<2xi32>) -> tensor<2xi32>
    %31 = "mhlo.reduce"(%30, %1) ({
    ^bb0(%arg1: tensor<i32>, %arg2: tensor<i32>):
      %45 = "mhlo.multiply"(%arg1, %arg2) : (tensor<i32>, tensor<i32>) -> tensor<i32>
      "mhlo.return"(%45) : (tensor<i32>) -> ()
    }) {dimensions = dense<0> : tensor<1xi64>} : (tensor<2xi32>, tensor<i32>) -> tensor<i32>
    %32 = "mhlo.concatenate"(%30, %2) {dimension = 0 : i64} : (tensor<2xi32>, tensor<1xi32>) -> tensor<3xi32>
    %33 = "mhlo.torch_index_select"(%29, %4) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<3xi32>, tensor<1xi32>) -> tensor<1xi32>
    %34 = "mhlo.reduce"(%33, %1) ({
    ^bb0(%arg1: tensor<i32>, %arg2: tensor<i32>):
      %45 = "mhlo.multiply"(%arg1, %arg2) : (tensor<i32>, tensor<i32>) -> tensor<i32>
      "mhlo.return"(%45) : (tensor<i32>) -> ()
    }) {dimensions = dense<0> : tensor<1xi64>} : (tensor<1xi32>, tensor<i32>) -> tensor<i32>
    %35 = "tensor.expand_shape"(%31) {reassociation = []} : (tensor<i32>) -> tensor<1xi32>
    %36 = "tensor.expand_shape"(%34) {reassociation = []} : (tensor<i32>) -> tensor<1xi32>
    %37 = "mhlo.concatenate"(%35, %36) {dimension = 0 : i64} : (tensor<1xi32>, tensor<1xi32>) -> tensor<2xi32>
    %38 = "chlo.dynamic_reshape"(%27, %37) : (tensor<?x?x32xf32>, tensor<2xi32>) -> tensor<?x?xf32>
    %39 = "mhlo.dot"(%38, %18) : (tensor<?x?xf32>, tensor<32x10xf32>) -> tensor<?x10xf32>
    %40 = "chlo.dynamic_reshape"(%39, %32) : (tensor<?x10xf32>, tensor<3xi32>) -> tensor<?x?x?xf32>
    %41 = "shape.shape_of"(%40) : (tensor<?x?x?xf32>) -> tensor<3xindex>
    %42 = "mhlo.dynamic_broadcast_in_dim"(%17, %41) {broadcast_dimensions = dense<2> : tensor<1xi64>} : (tensor<10xf32>, tensor<3xindex>) -> tensor<?x?x?xf32>
    %43 = "mhlo.add"(%40, %42) : (tensor<?x?x?xf32>, tensor<?x?x?xf32>) -> tensor<?x?x?xf32>
    %44 = "tensor.cast"(%43) : (tensor<?x?x?xf32>) -> tensor<?x?x10xf32>
    "func.return"(%44) : (tensor<?x?x10xf32>) -> ()
  }) {function_type = (tensor<?x2x16xf32>) -> tensor<?x?x10xf32>, sym_name = "serving_default__ireesm", sym_visibility = "private", tf.entry_function = {control_outputs = "", inputs = "serving_default_dense_input:0", outputs = "StatefulPartitionedCall:0"}} : () -> ()
}) : () -> ()

